2376854787/SmartLock/platform/STM32/ports/spi/hal_spi_port.c
#include "APP_config.h"
#if defined(CFG_TARGET_PLATFORM_STM32_HAL) && defined(CFG_FEAT_HAL_SPI) && (CFG_FEAT_HAL_SPI == 1)

#include <limits.h>
#include <string.h>

#include "hal_spi_port.h"
#include "osal.h"
#include "stm32_spi_series.h"

/* 状态码 */
#define SPI_PORT_PARAM(reason_)   RET_MAKE_PARAM(RET_MOD_PORT, RET_SUB_PORT_STM32, (reason_))
#define SPI_PORT_STATE(reason_)   RET_MAKE_STATE(RET_MOD_PORT, RET_SUB_PORT_STM32, (reason_))
#define SPI_PORT_TIMEOUT(reason_) RET_MAKE_TIMEOUT(RET_MOD_PORT, RET_SUB_PORT_STM32, (reason_))
#define SPI_PORT_IO(reason_)      RET_MAKE_IO(RET_MOD_PORT, RET_SUB_PORT_STM32, (reason_))
#define SPI_PORT_RES(reason_)     RET_MAKE_RESOURCE(RET_MOD_PORT, RET_SUB_PORT_STM32, (reason_))

/* 打开的 SPI 端口注册表：用于在 HAL 回调里反查 ctx */
static hal_spi_port_ctx_t *s_spi_ctxs[HAL_SPI_BUS_MAX];

__WEAK ret_code_t stm32_spi_bsp_get(uint8_t bus_id, stm32_spi_bsp_t *out) {
    (void)bus_id;
    (void)out;
    /* 默认not_ready */
    return RET_MAKE_STATE(RET_MOD_PORT, RET_SUB_PORT_STM32, RET_R_NOT_READY);
}

__WEAK uint32_t stm32_spi_busclk_hz(const SPI_HandleTypeDef *hspi) {
    (void)hspi;
    return 48000000u;
}

__WEAK void stm32_spi_dma_tx_clean(const void *ptr, uint32_t len) {
    (void)ptr;
    (void)len;
}

__WEAK void stm32_spi_dma_rx_invalidate(const void *ptr, uint32_t len) {
    (void)ptr;
    (void)len;
}

/**
 * @brief 安全的依据目标设备而返回安全的分频系数
 * @param src_hz 总线频率
 * @param target_hz 目标设备需要的频率
 * @return 预分频系数
 */
static uint32_t pick_prescaler(uint32_t src_hz, uint32_t target_hz) {
    if (target_hz == 0u) return SPI_BAUDRATEPRESCALER_256;
    const uint32_t div = (src_hz + target_hz - 1u) / target_hz;

    if (div <= 2u) return SPI_BAUDRATEPRESCALER_2;
    if (div <= 4u) return SPI_BAUDRATEPRESCALER_4;
    if (div <= 8u) return SPI_BAUDRATEPRESCALER_8;
    if (div <= 16u) return SPI_BAUDRATEPRESCALER_16;
    if (div <= 32u) return SPI_BAUDRATEPRESCALER_32;
    if (div <= 64u) return SPI_BAUDRATEPRESCALER_64;
    if (div <= 128u) return SPI_BAUDRATEPRESCALER_128;
    return SPI_BAUDRATEPRESCALER_256;
}
/**
 * @brief 把自定义的枚举映射为底层配置需要的时钟相位、极性
 * @param m 枚举模式
 * @param cpol 极性
 * @param cpha 相位
 */
static void map_mode(hal_spi_mode_t m, uint32_t *cpol, uint32_t *cpha) {
    switch (m) {
        case HAL_SPI_MODE0:
            *cpol = SPI_POLARITY_LOW;
            *cpha = SPI_PHASE_1EDGE;
            break;
        case HAL_SPI_MODE1:
            *cpol = SPI_POLARITY_LOW;
            *cpha = SPI_PHASE_2EDGE;
            break;
        case HAL_SPI_MODE2:
            *cpol = SPI_POLARITY_HIGH;
            *cpha = SPI_PHASE_1EDGE;
            break;
        default:
            *cpol = SPI_POLARITY_HIGH;
            *cpha = SPI_PHASE_2EDGE;
            break;
    }
}
/**
 * @brief 查找空闲注册槽位
 * @return 槽位索引，不存在返回 -1
 */
static int32_t find_free_slot(void) {
    for (int32_t i = 0; i < (int32_t)HAL_SPI_BUS_MAX; i++) {
        if (s_spi_ctxs[i] == NULL) return i;
    }
    return -1;
}
/**
 * @brief 根据 HAL 句柄反查端口上下文
 * @param hspi SPI HAL 句柄
 * @return 端口上下文
 */
static hal_spi_port_ctx_t *find_ctx_by_hspi(const SPI_HandleTypeDef *hspi) {
    if (!hspi) return NULL;
    for (uint32_t i = 0; i < HAL_SPI_BUS_MAX; i++) {
        if (s_spi_ctxs[i] && s_spi_ctxs[i]->opened && s_spi_ctxs[i]->bsp.hspi == hspi) {
            return s_spi_ctxs[i];
        }
    }
    return NULL;
}
/**
 * @brief 清理异步传输上下文
 * @param ctx port 句柄
 */
static inline void clear_xfer_ctx(hal_spi_port_ctx_t *ctx) {
    if (!ctx) return;
    ctx->xfer_busy        = 0u;
    ctx->req_type         = HAL_SPI_PORT_REQ_NONE;
    ctx->active_len       = 0u;
    ctx->active_tx        = NULL;
    ctx->active_rx        = NULL;
    ctx->hw_stream_active = false;
}
/**
 * @brief 统一把 HAL 状态映射为 port 错误码
 * @param st HAL 状态
 * @return port 错误码
 */
static ret_code_t map_hal_status(HAL_StatusTypeDef st) {
    if (st == HAL_OK) return RET_OK;
    if (st == HAL_TIMEOUT) return SPI_PORT_TIMEOUT(RET_R_TIMEOUT);
    if (st == HAL_BUSY) return SPI_PORT_STATE(RET_R_BUSY);
    return SPI_PORT_IO(RET_R_HW_FAULT);
}
/**
 * @brief 把当前的rx tx地址转化为port层使用的通信方向
 * @param xfer 事务句柄
 * @return 通信方向
 */
static inline hal_spi_port_req_t resolve_req_type(const hal_spi_xfer_t *xfer) {
    if (!xfer) return HAL_SPI_PORT_REQ_NONE;
    if (xfer->tx && xfer->rx) return HAL_SPI_PORT_REQ_TXRX;
    if (xfer->tx) return HAL_SPI_PORT_REQ_TX;
    if (xfer->rx) return HAL_SPI_PORT_REQ_RX;
    return HAL_SPI_PORT_REQ_NONE;
}

static bool is_dma_circular_cfg(const DMA_HandleTypeDef *hdma) {
    if (!hdma) return false;
#if defined(DMA_CIRCULAR)
    return (hdma->Init.Mode == DMA_CIRCULAR);
#else
    return false;
#endif
}
/**
 * @brief 检查当前的配置 和 DMA配置是否相符
 * @param ctx port层SPI句柄
 * @param xfer 事务配置
 * @param hspi 底层SPI句柄
 * @param req_type 当前事务类型
 * @return
 */
static ret_code_t validate_xfer_runtime(const hal_spi_port_ctx_t *ctx, const hal_spi_xfer_t *xfer,
                                        const SPI_HandleTypeDef *hspi,
                                        hal_spi_port_req_t req_type) {
    if (!ctx || !xfer || !hspi) return SPI_PORT_PARAM(RET_R_NULL_PTR);

    const uint32_t mode = hspi->Init.Mode;
    const uint32_t dir  = hspi->Init.Direction;
    /* ============= 模式组合合法性 检查 =========== */
    /* 发送接收地址不能都为空 */
    if (req_type == HAL_SPI_PORT_REQ_NONE) return SPI_PORT_PARAM(RET_R_INVALID_ARG);

    /* 单线/双线仅接收模式不支持 TxRx API 组合。 */
    if ((req_type == HAL_SPI_PORT_REQ_TXRX) && (dir != SPI_DIRECTION_2LINES))
        return SPI_PORT_PARAM(RET_R_UNSUPPORTED);
    /* 仅接收方向禁止仅发送。 */
    if ((req_type == HAL_SPI_PORT_REQ_TX) && (dir == SPI_DIRECTION_2LINES_RXONLY))
        return SPI_PORT_PARAM(RET_R_UNSUPPORTED);

    /* DMA 检查 */
    if (ctx->use_dma) {
        /* 必须初始化对应的 DMA通道 */
        switch (req_type) {
            case HAL_SPI_PORT_REQ_TXRX:
                if (!ctx->bsp.hdma_tx || !ctx->bsp.hdma_rx) return SPI_PORT_STATE(RET_R_NOT_READY);
                break;
            case HAL_SPI_PORT_REQ_TX:
                if (!ctx->bsp.hdma_tx) return SPI_PORT_STATE(RET_R_NOT_READY);
                break;
            case HAL_SPI_PORT_REQ_RX:
                if (!ctx->bsp.hdma_rx) return SPI_PORT_STATE(RET_R_NOT_READY);
                /*
                 * F4 HAL 在 Master+2LINES+RxOnly 下会走 TxRx DMA 以产生时钟，
                 * 因此这里要求同时具备 TX DMA，避免运行期断言失败。
                 */
                if ((mode == SPI_MODE_MASTER) && (dir == SPI_DIRECTION_2LINES) &&
                    !ctx->bsp.hdma_tx) {
                    return SPI_PORT_STATE(RET_R_NOT_READY);
                }
                break;
            default:
                return SPI_PORT_PARAM(RET_R_INVALID_ARG);
        }
    }

