2376854787/SmartLock/platform/STM32/ports/spi/hal_spi_port.c
#if defined(CFG_PARAM_SPI_STRICT_XFER_CHECK) && (CFG_PARAM_SPI_STRICT_XFER_CHECK == 1)
    /* 严格模式：补充策略约束 补充检查当前的是不是循环模式 */
    const bool is_stream   = (xfer->flags & HAL_SPI_XFER_STREAM) != 0u;
    const bool stream_last = (xfer->flags & HAL_SPI_XFER_STREAM_END) != 0u;
    const bool hw_stream   = (xfer->flags & HAL_SPI_XFER_HW_STREAM) != 0u;

    if (stream_last && !is_stream) return SPI_PORT_PARAM(RET_R_INVALID_ARG);
    if (hw_stream && !ctx->use_dma) return SPI_PORT_PARAM(RET_R_UNSUPPORTED);

    if (hw_stream && ctx->use_dma) {
        switch (req_type) {
            case HAL_SPI_PORT_REQ_TXRX:
                if (!is_dma_circular_cfg(ctx->bsp.hdma_tx) ||
                    !is_dma_circular_cfg(ctx->bsp.hdma_rx))
                    return SPI_PORT_PARAM(RET_R_UNSUPPORTED);
                break;
            case HAL_SPI_PORT_REQ_TX:
                if (!is_dma_circular_cfg(ctx->bsp.hdma_tx))
                    return SPI_PORT_PARAM(RET_R_UNSUPPORTED);
                break;
            case HAL_SPI_PORT_REQ_RX:
                if (!is_dma_circular_cfg(ctx->bsp.hdma_rx))
                    return SPI_PORT_PARAM(RET_R_UNSUPPORTED);
                if ((mode == SPI_MODE_MASTER) && (dir == SPI_DIRECTION_2LINES) &&
                    !is_dma_circular_cfg(ctx->bsp.hdma_tx)) {
                    return SPI_PORT_PARAM(RET_R_UNSUPPORTED);
                }
                break;
            default:
                return SPI_PORT_PARAM(RET_R_INVALID_ARG);
        }
    }

    /* Master 单线/双线仅接收不支持流模式（软/硬） */
    if ((is_stream || hw_stream) && (mode == SPI_MODE_MASTER) &&
        ((dir == SPI_DIRECTION_1LINE) || (dir == SPI_DIRECTION_2LINES_RXONLY))) {
        return SPI_PORT_PARAM(RET_R_UNSUPPORTED);
    }
#else
    (void)xfer;
#endif
    return RET_OK;
}
/**
 * @brief 根据传入的字节大小和 位宽计算出底层真正的传输 len
 * @param h 底层SPI句柄
 * @param xfer 事务句柄
 * @param tx  数据接收地址
 * @param rx  数据源地址
 * @param out_frame_count 返回实际给底层api 的 len长度
 * @return 32位状态码
 */
static ret_code_t calc_xfer_frame_meta(const SPI_HandleTypeDef *h, const hal_spi_xfer_t *xfer,
                                       const uint8_t *tx, uint8_t *rx, uint16_t *out_frame_count) {
    if (!h || !xfer || !out_frame_count) return SPI_PORT_PARAM(RET_R_NULL_PTR);

    uint32_t frame_bytes = 1u;
#if defined(SPI_DATASIZE_16BIT)
    if (h->Init.DataSize == SPI_DATASIZE_16BIT) frame_bytes = 2u;
#endif
    if ((xfer->len % frame_bytes) != 0u) return SPI_PORT_PARAM(RET_R_RANGE_ERR);

    const uint32_t frame_count = xfer->len / frame_bytes;
    if (frame_count == 0u || frame_count > (uint32_t)UINT16_MAX) {
        return SPI_PORT_PARAM(RET_R_RANGE_ERR);
    }

    /* 16bit 帧时要求地址按 half-word 对齐，避免 DMA/外设访问异常 */
    if (frame_bytes == 2u) {
        if ((tx && (((uintptr_t)tx & 0x1u) != 0u)) || (rx && (((uintptr_t)rx & 0x1u) != 0u))) {
            return SPI_PORT_PARAM(RET_R_INVALID_ARG);
        }
    }

    *out_frame_count = (uint16_t)frame_count;
    return RET_OK;
}

static inline void spi_dma_prepare_tx_buf(const uint8_t *tx, uint32_t len) {
    if (tx && len) stm32_spi_dma_tx_clean(tx, len);
}

static inline void spi_dma_prepare_rx_buf(uint8_t *rx, uint32_t len) {
    if (rx && len) stm32_spi_dma_rx_invalidate(rx, len);
}
/**
 * @brief 按 IRQn 分发到已注册的 SPI HAL IRQ 处理函数
 * @param irqn 当前中断号
 */
static void dispatch_spi_irq(IRQn_Type irqn) {
    for (uint32_t i = 0; i < HAL_SPI_BUS_MAX; i++) {
        hal_spi_port_ctx_t *ctx = s_spi_ctxs[i];
        /* 必须是已经注册且端口已经注册 且 拿到了句柄 */
        if (!ctx || !ctx->opened || !ctx->use_irq) continue;
        if (ctx->bsp.spi_irq == irqn && ctx->bsp.hspi) {
            HAL_SPI_IRQHandler(ctx->bsp.hspi);
            return;
        }
    }
}
/**
 * @brief 分发异步完成回调
 * @param ctx 端口句柄
 * @param rc port 语义返回码
 * @param bytes 完成字节数
 */
static void emit_port_evt(hal_spi_port_ctx_t *ctx, hal_spi_port_evt_type_t type, ret_code_t rc,
                          uint32_t bytes, bool clear_ctx) {
    if (!ctx) return;
    const hal_spi_port_evt_t evt = {
        .type    = type,
        .rc_port = rc,
        .bytes   = bytes,
    };
    if (clear_ctx) clear_xfer_ctx(ctx);
    if (ctx->evt_cb) ctx->evt_cb(ctx->evt_user, &evt);
}
/**
 * @brief 获取板级的句柄并完成总线能力初始化
 * @param cfg 总线配置给 port层缓存一份dma、irq的配置用于 port层配置的合法判断
 * @param out 返回底层的SPI句柄
 * @return 32位状态码
 * @note DMA / IRQ 开关由 cfg 控制
 */
ret_code_t hal_spi_port_open(const hal_spi_bus_cfg_t *cfg, hal_spi_port_ctx_t *out) {
    if (!cfg || !out) return SPI_PORT_PARAM(RET_R_NULL_PTR);
    memset(out, 0, sizeof(*out));

    /* 至少选择一种异步能力 */
    if (!cfg->use_dma && !cfg->use_irq) return SPI_PORT_PARAM(RET_R_UNSUPPORTED);

    /* 根据板级id 让bsp填充 资源池中的对象的配置SPI句柄、DMA句柄 、中断、中断优先级 */
    const ret_code_t rc = stm32_spi_bsp_get(cfg->bus_id, &out->bsp);
    if (ret_is_err(rc)) return rc;
    if (!out->bsp.hspi) return SPI_PORT_STATE(RET_R_NOT_READY);

    out->use_dma = cfg->use_dma;
    out->use_irq = cfg->use_irq;

    /* 若启用 DMA，仅做句柄关联（DMA init 由外部 BSP/Cube 完成） */
    if (out->use_dma) {
        if (!out->bsp.hdma_tx && !out->bsp.hdma_rx) return SPI_PORT_STATE(RET_R_NOT_READY);
        if (out->bsp.hdma_tx && !out->bsp.hspi->hdmatx) {
            out->bsp.hspi->hdmatx    = out->bsp.hdma_tx;
            out->bsp.hdma_tx->Parent = out->bsp.hspi;
        }
        if (out->bsp.hdma_rx && !out->bsp.hspi->hdmarx) {
            out->bsp.hspi->hdmarx    = out->bsp.hdma_rx;
            out->bsp.hdma_rx->Parent = out->bsp.hspi;
        }
    }

    /* 若启用 SPI 中断，在端口层完成 NVIC 配置 */
    if (out->use_irq) {
        if ((int32_t)out->bsp.spi_irq < 0) return SPI_PORT_STATE(RET_R_NOT_READY);
        HAL_NVIC_SetPriority(out->bsp.spi_irq, out->bsp.irq_prio, out->bsp.irq_sub_prio);
        HAL_NVIC_EnableIRQ(out->bsp.spi_irq);
    }
    /* 注册port（临界区保护，避免并发 open 抢同一槽位） */
    int32_t slot         = -1;
    osal_crit_state_t cs = 0u;
    OSAL_enter_critical_ex(&cs);
    slot = find_free_slot();
    if (slot >= 0) s_spi_ctxs[slot] = out;
    OSAL_exit_critical_ex(cs);
    if (slot < 0) return SPI_PORT_RES(RET_R_NO_RESOURCE);
    out->opened = true;
    return RET_OK;
}
/**
 * @brief 关闭端口占用的底层资源并复位上下文
 * @param ctx 底层port上下文
 * @return 32位状态码
 */
ret_code_t hal_spi_port_close(hal_spi_port_ctx_t *ctx) {
    /* 参数检查 */
    if (!ctx) return SPI_PORT_PARAM(RET_R_NULL_PTR);
    if (!ctx->opened) return SPI_PORT_STATE(RET_R_NOT_READY);
    if (ctx->xfer_busy) return SPI_PORT_STATE(RET_R_BUSY);

