2376854787/SmartLock/platform/STM32/ports/spi/hal_spi_port.c
    osal_crit_state_t cs = 0u;
    OSAL_enter_critical_ex(&cs);
    for (uint32_t i = 0; i < HAL_SPI_BUS_MAX; i++) {
        if (s_spi_ctxs[i] == ctx) {
            s_spi_ctxs[i] = NULL;
            break;
        }
    }
    OSAL_exit_critical_ex(cs);
    /* 关闭DMA 中断*/
    if (ctx->use_irq && (int32_t)ctx->bsp.spi_irq >= 0) {
        HAL_NVIC_DisableIRQ(ctx->bsp.spi_irq);
    }
    /* 关闭SPI 句柄初始化 */
    if (ctx->bsp.hspi) {
        (void)HAL_SPI_DeInit(ctx->bsp.hspi);
    }
    memset(ctx, 0, sizeof(*ctx));
    return RET_OK;
}
/**
 * @brief 注册 port 层异步完成回调
 * @param ctx port 句柄
 * @param cb 完成回调
 * @param user 用户上下文
 * @return 32位状态码
 */
ret_code_t hal_spi_port_set_evt_cb(hal_spi_port_ctx_t *ctx, hal_spi_port_evt_cb_t cb, void *user) {
    if (!ctx) return SPI_PORT_PARAM(RET_R_NULL_PTR);
    ctx->evt_cb   = cb;
    ctx->evt_user = user;
    return RET_OK;
}
/**
 *
 * @param ctx 板级SPI句柄
 * @param dev_cfg 设备的配置
 * @param bus_default_hz 默认频率
 * @return
 */
ret_code_t hal_spi_port_apply(hal_spi_port_ctx_t *ctx, const hal_spi_dev_cfg_t *dev_cfg,
                              uint32_t bus_default_hz) {
    /* 参数检查 */
    if (!ctx || !dev_cfg) return SPI_PORT_PARAM(RET_R_NULL_PTR);
    if (!ctx->opened) return SPI_PORT_STATE(RET_R_NOT_READY);
    /* 不能在已有事务进行的情况下 重新配置 */
    if (ctx->xfer_busy) return SPI_PORT_STATE(RET_R_BUSY);

    /* 取出句柄的地址 */
    SPI_HandleTypeDef *h = ctx->bsp.hspi;
    if (!h) return SPI_PORT_STATE(RET_R_NOT_READY);
    /* 通信频率 <= default_hz */
    const uint32_t hz = (dev_cfg->max_hz < bus_default_hz) ? dev_cfg->max_hz : bus_default_hz;
    /* 参数没变就不初始化了 */
    if (ctx->cfg_cache_valid && ctx->cur_mode == dev_cfg->mode &&
        ctx->cur_order == dev_cfg->bit_order && ctx->cur_bits == dev_cfg->frame_bits &&
        ctx->cur_hz == hz) {
        return RET_OK;
    }
    /* 时钟相位、和极性 */
    uint32_t cpol = 0u, cpha = 0u;
    map_mode(dev_cfg->mode, &cpol, &cpha);

    /* 按需重配 */
    (void)HAL_SPI_DeInit(h);

    h->Init.Mode        = dev_cfg->is_master ? SPI_MODE_MASTER : SPI_MODE_SLAVE;
    h->Init.Direction   = dev_cfg->dir == HAL_SPI_DIR_LINE            ? SPI_DIRECTION_1LINE
                          : dev_cfg->dir == HAL_SPI_DIR_2LINES_RXONLY ? SPI_DIRECTION_2LINES_RXONLY
                                                                      : SPI_DIRECTION_2LINES;
    h->Init.CLKPolarity = cpol;
    h->Init.CLKPhase    = cpha;
    /* NSS 选择：软件片选固定 SOFT；硬件片选按主从选择输出/输入 */
    if (dev_cfg->cs_type == HAL_SPI_CS_GPIO) {
        h->Init.NSS = SPI_NSS_SOFT;
    } else {
        h->Init.NSS = dev_cfg->is_master ? SPI_NSS_HARD_OUTPUT : SPI_NSS_HARD_INPUT;
    }
    h->Init.FirstBit =
        (dev_cfg->bit_order == HAL_SPI_BITORDER_LSB) ? SPI_FIRSTBIT_LSB : SPI_FIRSTBIT_MSB;
    h->Init.TIMode =
        dev_cfg->use_ti_mode ? SPI_TIMODE_ENABLE : SPI_TIMODE_DISABLE; /* 德州仪器模式 */
    h->Init.CRCCalculation =
        dev_cfg->use_crc ? SPI_CRCCALCULATION_ENABLE : SPI_CRCCALCULATION_DISABLE; /* CRC计算 */

#if defined(SPI_DATASIZE_16BIT)
    h->Init.DataSize =
        (dev_cfg->frame_bits == HAL_SPI_FRAME_16) ? SPI_DATASIZE_16BIT : SPI_DATASIZE_8BIT;
#else
    /* 老 HAL 版本不支持可变 datasize：直接拒绝 16bit */
    if (dev_cfg->frame_bits == HAL_SPI_FRAME_16) return SPI_PORT_PARAM(RET_R_UNSUPPORTED);
    h->Init.DataSize = SPI_DATASIZE_8BIT;
#endif
    /* 返回当前句柄挂载的总线频率 */
    const uint32_t src        = stm32_spi_busclk_hz(h);
    /* 根据总线频率和目标频率预分频 */
    h->Init.BaudRatePrescaler = pick_prescaler(src, hz);

    if (HAL_SPI_Init(h) != HAL_OK) return SPI_PORT_IO(RET_R_HW_FAULT);
    /* 当前配置判定生效 */
    ctx->cfg_cache_valid = true;
    ctx->cur_mode        = dev_cfg->mode;
    ctx->cur_order       = dev_cfg->bit_order;
    ctx->cur_bits        = dev_cfg->frame_bits;
    ctx->cur_hz          = hz;
    return RET_OK;
}
/**
 * @brief
 * @param ctx
 * @param xfer
 * @return
 */
ret_code_t hal_spi_port_stream_start(hal_spi_port_ctx_t *ctx, const hal_spi_xfer_t *xfer) {
    /* 参数检查 */
    if (!ctx || !xfer) return SPI_PORT_PARAM(RET_R_NULL_PTR);
    if (!ctx->opened) return SPI_PORT_STATE(RET_R_NOT_READY);
    if (ctx->xfer_busy) return SPI_PORT_STATE(RET_R_BUSY);
    if (!ctx->use_dma) return SPI_PORT_PARAM(RET_R_UNSUPPORTED);

    SPI_HandleTypeDef *h = ctx->bsp.hspi;
    /* 必须已经注册 */
    if (!h) return SPI_PORT_STATE(RET_R_NOT_READY);
    if (xfer->len == 0u) return SPI_PORT_PARAM(RET_R_RANGE_ERR);
    /* 获取 事务 */
    hal_spi_xfer_t stream_xfer = *xfer;
    /* 添加上 硬件DMA 流事务 */
    stream_xfer.flags |= HAL_SPI_XFER_HW_STREAM;
    /* 判断当前是什么方向的传输 */
    const hal_spi_port_req_t req_type = resolve_req_type(&stream_xfer);
    /* 检查当前的传输方向、DMA、配置是否是合法的组合 */
    const ret_code_t vrc              = validate_xfer_runtime(ctx, &stream_xfer, h, req_type);
    if (ret_is_err(vrc)) return vrc;

    const uint8_t *tx = (const uint8_t *)stream_xfer.tx;
    uint8_t *rx       = (uint8_t *)stream_xfer.rx;
    uint16_t frame_count;
    /* 计算真正的 传输len */
    const ret_code_t frc = calc_xfer_frame_meta(h, &stream_xfer, tx, rx, &frame_count);
    if (ret_is_err(frc)) return frc;
    /* 失效 和 清理缓存 */
    spi_dma_prepare_tx_buf(tx, stream_xfer.len);
    spi_dma_prepare_rx_buf(rx, stream_xfer.len);

    HAL_StatusTypeDef st  = HAL_ERROR;
    ctx->xfer_busy        = 1u;
    ctx->req_type         = req_type;
    ctx->active_len       = stream_xfer.len;
    ctx->active_tx        = tx;
    ctx->active_rx        = rx;
    ctx->hw_stream_active = true;
    /* 发送、接收数据 */
    switch (req_type) {
        case HAL_SPI_PORT_REQ_TXRX:
            st = HAL_SPI_TransmitReceive_DMA(h, (uint8_t *)tx, rx, (uint16_t)frame_count);
            break;
        case HAL_SPI_PORT_REQ_TX:
            st = HAL_SPI_Transmit_DMA(h, (uint8_t *)tx, (uint16_t)frame_count);
            break;
        case HAL_SPI_PORT_REQ_RX:
            st = HAL_SPI_Receive_DMA(h, rx, (uint16_t)frame_count);
            break;
        default:
            clear_xfer_ctx(ctx);
            return SPI_PORT_PARAM(RET_R_INVALID_ARG);
    }

    if (st != HAL_OK) {
        clear_xfer_ctx(ctx);
        return map_hal_status(st);
    }
    return RET_OK;
}
/**
 * @brief 停止DMA 根据配置决定DeInit SPI
 * @param ctx port 句柄
 * @param disable_spi 是否 DeInit SPI
 * @return
 */
ret_code_t hal_spi_port_stream_stop(hal_spi_port_ctx_t *ctx, bool disable_spi) {
    /* 参数检查 */
    if (!ctx) return SPI_PORT_PARAM(RET_R_NULL_PTR);
    if (!ctx->opened) return SPI_PORT_STATE(RET_R_NOT_READY);
    if (!ctx->hw_stream_active) return SPI_PORT_STATE(RET_R_NOT_READY);
    if (!ctx->bsp.hspi) return SPI_PORT_STATE(RET_R_NOT_READY);
    /* 停止DMA  */
    if (HAL_SPI_DMAStop(ctx->bsp.hspi) != HAL_OK) {
        return SPI_PORT_IO(RET_R_HW_FAULT);
    }
    /* DeInit DMA */
    if (disable_spi) {
        if (HAL_SPI_DeInit(ctx->bsp.hspi) != HAL_OK) {
            return SPI_PORT_IO(RET_R_HW_FAULT);
        }
        ctx->cfg_cache_valid = false;
    }
    /* 清理事务 */
    clear_xfer_ctx(ctx);
    return RET_OK;
}
/**
 * @brief 发起一次异步 SPI 传输（发起后立即返回）
 * @param ctx 底层SPI句柄
 * @param xfer 每次传输的配置信息 决定当前是全双工半双工
 * @return
 */
ret_code_t hal_spi_port_xfer(hal_spi_port_ctx_t *ctx, const hal_spi_xfer_t *xfer) {
    /* 参数检查 */
    if (!ctx || !xfer) return SPI_PORT_PARAM(RET_R_NULL_PTR);
    if (!ctx->opened) return SPI_PORT_STATE(RET_R_NOT_READY);
    if (ctx->xfer_busy) return SPI_PORT_STATE(RET_R_BUSY);

    SPI_HandleTypeDef *h = ctx->bsp.hspi;
    if (!h) return SPI_PORT_STATE(RET_R_NOT_READY);

    if (xfer->len == 0u) return SPI_PORT_PARAM(RET_R_RANGE_ERR);
    if (xfer->flags & HAL_SPI_XFER_HW_STREAM) return SPI_PORT_PARAM(RET_R_UNSUPPORTED);
    if (!ctx->use_dma && !ctx->use_irq) return SPI_PORT_PARAM(RET_R_UNSUPPORTED);
    /* 发送和接收的地址 */
    const uint8_t *tx                 = (const uint8_t *)xfer->tx;
    uint8_t *rx                       = (uint8_t *)xfer->rx;
    /* 判断方向 */
    const hal_spi_port_req_t req_type = resolve_req_type(xfer);
    /* 检查当前是否是有效的配置 DMA 和 hal配置 */
    const ret_code_t vrc              = validate_xfer_runtime(ctx, xfer, h, req_type);
    if (ret_is_err(vrc)) return vrc;

    uint16_t frame_count;
    /* 检查对齐 计算出真正的传输len */
    const ret_code_t frc = calc_xfer_frame_meta(h, xfer, tx, rx, &frame_count);
    if (ret_is_err(frc)) return frc;
    if (ctx->use_dma) {
        spi_dma_prepare_tx_buf(tx, xfer->len);
        spi_dma_prepare_rx_buf(rx, xfer->len);
    }

    HAL_StatusTypeDef st  = HAL_ERROR;
    ctx->xfer_busy        = 1u;
    ctx->req_type         = req_type;
    ctx->active_len       = xfer->len;
    ctx->active_tx        = tx;
    ctx->active_rx        = rx;
    ctx->hw_stream_active = false;
    /* 根据传输的方向和dma配置 完成对应的 API 调用 */
    switch (req_type) {
        case HAL_SPI_PORT_REQ_TXRX:
            if (ctx->use_dma) {
                st = HAL_SPI_TransmitReceive_DMA(h, (uint8_t *)tx, rx, (uint16_t)frame_count);
            } else if (ctx->use_irq) {
                st = HAL_SPI_TransmitReceive_IT(h, (uint8_t *)tx, rx, (uint16_t)frame_count);
            } else {
                clear_xfer_ctx(ctx);
                return SPI_PORT_PARAM(RET_R_UNSUPPORTED);
            }
            break;
        case HAL_SPI_PORT_REQ_TX:
            if (ctx->use_dma) {
                st = HAL_SPI_Transmit_DMA(h, (uint8_t *)tx, (uint16_t)frame_count);
            } else if (ctx->use_irq) {
                st = HAL_SPI_Transmit_IT(h, (uint8_t *)tx, (uint16_t)frame_count);
            } else {
                clear_xfer_ctx(ctx);
                return SPI_PORT_PARAM(RET_R_UNSUPPORTED);
            }
            break;
        case HAL_SPI_PORT_REQ_RX:
            if (ctx->use_dma) {
                st = HAL_SPI_Receive_DMA(h, rx, (uint16_t)frame_count);
            } else if (ctx->use_irq) {
                st = HAL_SPI_Receive_IT(h, rx, (uint16_t)frame_count);
            } else {
                clear_xfer_ctx(ctx);
                return SPI_PORT_PARAM(RET_R_UNSUPPORTED);
            }
            break;
        default:
            clear_xfer_ctx(ctx);
            return SPI_PORT_PARAM(RET_R_INVALID_ARG);
    }

    if (st != HAL_OK) {
        clear_xfer_ctx(ctx);
        return map_hal_status(st);
    }
    return RET_OK;
}

