2376854787/SmartLock/platform/STM32/ports/spi/hal_spi_port.c
void hal_spi_port_irq_dispatch_hook(IRQn_Type irqn) {
    dispatch_spi_irq(irqn);
}
/**
 * @brief SPI 发送过半回调钩子
 * @param hspi 底层 SPI 句柄
 * @note 仅在 [仅发送 (TX) + 硬件流模式] 下触发，向上层抛出 HAL_SPI_PORT_EVT_STREAM_HALF 事件
 */
void hal_spi_port_tx_half_cplt_hook(SPI_HandleTypeDef *hspi) {
    hal_spi_port_ctx_t *ctx = find_ctx_by_hspi(hspi);
    if (!ctx || !ctx->xfer_busy || !ctx->hw_stream_active) return;
    if (ctx->req_type != HAL_SPI_PORT_REQ_TX) return;
    const uint32_t half_len         = ctx->active_len / 2u;
    const uint8_t *const second_ptr = (ctx->active_tx) ? (ctx->active_tx + half_len) : NULL;
    if (ctx->use_dma) spi_dma_prepare_tx_buf(second_ptr, ctx->active_len - half_len);
    emit_port_evt(ctx, HAL_SPI_PORT_EVT_STREAM_HALF, RET_OK, ctx->active_len / 2u, false);
}

/**
 * @brief SPI 接收过半回调钩子
 * @param hspi 底层 SPI 句柄
 * @note 仅在 [仅接收 (RX) + 硬件流模式] 下触发，向上层抛出 HAL_SPI_PORT_EVT_STREAM_HALF 事件
 */
void hal_spi_port_rx_half_cplt_hook(SPI_HandleTypeDef *hspi) {
    hal_spi_port_ctx_t *ctx = find_ctx_by_hspi(hspi);
    if (!ctx || !ctx->xfer_busy || !ctx->hw_stream_active) return;
    if (ctx->req_type != HAL_SPI_PORT_REQ_RX) return;
    const uint32_t half_len = ctx->active_len / 2u;
    if (ctx->use_dma) spi_dma_prepare_rx_buf(ctx->active_rx, half_len);
    emit_port_evt(ctx, HAL_SPI_PORT_EVT_STREAM_HALF, RET_OK, ctx->active_len / 2u, false);
}

/**
 * @brief SPI 发送完成回调钩子
 * @param hspi 底层 SPI 句柄
 * @note 适用于 [仅发送 (TX)] 模式。
 * - 硬件流模式：抛出 STREAM_FULL 事件（不释放上下文）
 * - 普通事务模式：抛出 DONE 事件（并释放上下文）
 */
void hal_spi_port_tx_cplt_hook(SPI_HandleTypeDef *hspi) {
    hal_spi_port_ctx_t *ctx = find_ctx_by_hspi(hspi);
    if (!ctx || !ctx->xfer_busy || (ctx->req_type != HAL_SPI_PORT_REQ_TX)) return;
    if (ctx->hw_stream_active) {
        const uint32_t half_len = ctx->active_len / 2u;
        if (ctx->use_dma) spi_dma_prepare_tx_buf(ctx->active_tx, half_len);
        emit_port_evt(ctx, HAL_SPI_PORT_EVT_STREAM_FULL, RET_OK, ctx->active_len, false);
        return;
    }
    emit_port_evt(ctx, HAL_SPI_PORT_EVT_DONE, RET_OK, ctx->active_len, true);
}

/**
 * @brief SPI 接收完成回调钩子
 * @param hspi 底层 SPI 句柄
 * @note 适用于 [仅接收 (RX)] 模式。
 * - 硬件流模式：抛出 STREAM_FULL 事件（不释放上下文）
 * - 普通事务模式：抛出 DONE 事件（并释放上下文）
 */
void hal_spi_port_rx_cplt_hook(SPI_HandleTypeDef *hspi) {
    hal_spi_port_ctx_t *ctx = find_ctx_by_hspi(hspi);
    if (!ctx || !ctx->xfer_busy || (ctx->req_type != HAL_SPI_PORT_REQ_RX)) return;
    if (ctx->hw_stream_active) {
        const uint32_t half_len   = ctx->active_len / 2u;
        uint8_t *const second_ptr = (ctx->active_rx) ? (ctx->active_rx + half_len) : NULL;
        if (ctx->use_dma) spi_dma_prepare_rx_buf(second_ptr, ctx->active_len - half_len);
        emit_port_evt(ctx, HAL_SPI_PORT_EVT_STREAM_FULL, RET_OK, ctx->active_len, false);
        return;
    }
    if (ctx->use_dma) spi_dma_prepare_rx_buf(ctx->active_rx, ctx->active_len);
    emit_port_evt(ctx, HAL_SPI_PORT_EVT_DONE, RET_OK, ctx->active_len, true);
}

/**
 * @brief SPI 全双工收发完成回调钩子
 * @param hspi 底层 SPI 句柄
 * @note 适用于 [全双工 (TXRX)] 模式。包含硬件流 (DMA Circular) 与单次事务。
 */
void hal_spi_port_txrx_cplt_hook(SPI_HandleTypeDef *hspi) {
    hal_spi_port_ctx_t *ctx = find_ctx_by_hspi(hspi);
    if (!ctx || !ctx->xfer_busy || (ctx->req_type != HAL_SPI_PORT_REQ_TXRX)) return;
    if (ctx->hw_stream_active) {
        const uint32_t half_len           = ctx->active_len / 2u;
        const uint8_t *const tx_first_ptr = ctx->active_tx;
        uint8_t *const second_ptr         = (ctx->active_rx) ? (ctx->active_rx + half_len) : NULL;
        if (ctx->use_dma) spi_dma_prepare_tx_buf(tx_first_ptr, half_len);
        if (ctx->use_dma) spi_dma_prepare_rx_buf(second_ptr, ctx->active_len - half_len);
        emit_port_evt(ctx, HAL_SPI_PORT_EVT_STREAM_FULL, RET_OK, ctx->active_len, false);
        return;
    }
    uint32_t bytes = ctx->active_len;
    if (hspi && hspi->hdmarx) {
        bytes = ctx->active_len - __HAL_DMA_GET_COUNTER(hspi->hdmarx);
    }
    if (ctx->use_dma) spi_dma_prepare_rx_buf(ctx->active_rx, bytes);
    emit_port_evt(ctx, HAL_SPI_PORT_EVT_DONE, RET_OK, bytes, true);
}

/**
 * @brief SPI 全双工收发过半回调钩子
 * @param hspi 底层 SPI 句柄
 * @note 仅在 [全双工 (TXRX) + 硬件流模式] 下触发，向上层抛出 HAL_SPI_PORT_EVT_STREAM_HALF 事件
 */
void hal_spi_port_txrx_half_cplt_hook(SPI_HandleTypeDef *hspi) {
    hal_spi_port_ctx_t *ctx = find_ctx_by_hspi(hspi);
    if (!ctx || !ctx->xfer_busy || !ctx->hw_stream_active) return;
    if (ctx->req_type != HAL_SPI_PORT_REQ_TXRX) return;
    const uint32_t half_len            = ctx->active_len / 2u;
    const uint8_t *const tx_second_ptr = (ctx->active_tx) ? (ctx->active_tx + half_len) : NULL;
    if (ctx->use_dma) spi_dma_prepare_tx_buf(tx_second_ptr, ctx->active_len - half_len);
    if (ctx->use_dma) spi_dma_prepare_rx_buf(ctx->active_rx, half_len);
    emit_port_evt(ctx, HAL_SPI_PORT_EVT_STREAM_HALF, RET_OK, ctx->active_len / 2u, false);
}

void hal_spi_port_error_hook(SPI_HandleTypeDef *hspi) {
    hal_spi_port_ctx_t *ctx = find_ctx_by_hspi(hspi);
    if (!ctx || !ctx->xfer_busy) return;
    emit_port_evt(ctx, HAL_SPI_PORT_EVT_ERROR, SPI_PORT_IO(RET_R_HW_FAULT), 0u, true);
}

#if defined(CFG_PARAM_SPI_PORT_USE_LOCAL_IRQ_HANDLER) && \
    (CFG_PARAM_SPI_PORT_USE_LOCAL_IRQ_HANDLER == 1)
#if defined(SPI1)
void SPI1_IRQHandler(void) {
    hal_spi_port_irq_dispatch_hook(SPI1_IRQn);
}
#endif
#if defined(SPI2)
void SPI2_IRQHandler(void) {
    hal_spi_port_irq_dispatch_hook(SPI2_IRQn);
}
#endif
#if defined(SPI3)
void SPI3_IRQHandler(void) {
    hal_spi_port_irq_dispatch_hook(SPI3_IRQn);
}
#endif
#if defined(SPI4)
void SPI4_IRQHandler(void) {
    hal_spi_port_irq_dispatch_hook(SPI4_IRQn);
}
#endif
#if defined(SPI5)
void SPI5_IRQHandler(void) {
    hal_spi_port_irq_dispatch_hook(SPI5_IRQn);
}
#endif
#if defined(SPI6)
void SPI6_IRQHandler(void) {
    hal_spi_port_irq_dispatch_hook(SPI6_IRQn);
}
#endif
#endif

#if defined(CFG_PARAM_SPI_PORT_USE_LOCAL_HAL_CALLBACKS) && \
    (CFG_PARAM_SPI_PORT_USE_LOCAL_HAL_CALLBACKS == 1)
/**
 * @brief SPI 发送完成回调（HAL 回调）
 * @param hspi SPI HAL 句柄
 */
void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi) {
    hal_spi_port_tx_cplt_hook(hspi);
}
void HAL_SPI_TxHalfCpltCallback(SPI_HandleTypeDef *hspi) {
    hal_spi_port_tx_half_cplt_hook(hspi);
}
/**
 * @brief SPI 接收完成回调（HAL 回调）
 * @param hspi SPI HAL 句柄
 */
void HAL_SPI_RxCpltCallback(SPI_HandleTypeDef *hspi) {
    hal_spi_port_rx_cplt_hook(hspi);
}
void HAL_SPI_RxHalfCpltCallback(SPI_HandleTypeDef *hspi) {
    hal_spi_port_rx_half_cplt_hook(hspi);
}
/**
 * @brief SPI 全双工完成回调（HAL 回调）
 * @param hspi SPI HAL 句柄
 */
void HAL_SPI_TxRxCpltCallback(SPI_HandleTypeDef *hspi) {
    hal_spi_port_txrx_cplt_hook(hspi);
}
/**
 * @brief SPI 全双工完成回调（HAL 回调）
 * @param hspi SPI HAL 句柄
 */
void HAL_SPI_TxRxHalfCpltCallback(SPI_HandleTypeDef *hspi) {
    hal_spi_port_txrx_half_cplt_hook(hspi);
}
/**
 * @brief SPI 错误回调（HAL 回调）
 * @param hspi SPI HAL 句柄
 */
void HAL_SPI_ErrorCallback(SPI_HandleTypeDef *hspi) {
    hal_spi_port_error_hook(hspi);
}
#endif

#endif
